# FacetingUtils Methods

---
The FacetingUtils type exposes the following members.
| Name| Description
---|---|---
| ConvertTrianglesToQuads|  Replaces pairs of adjacent, coplanar triangles by quadrilaterals.
Top
#### Reference
FacetingUtils Class
Autodesk.Revit.DB Namespace